---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateBalusterPatterns
source: html/897a60f1-b99a-d050-0646-d68d4c60f318.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateBalusterPatterns Property

Can't create Baluster Patterns for Railings

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateBalusterPatterns { get; }
```